machv/esp8266-irrigator/src/main.cpp
#include <FS.h> // FS needs to be the first
#include <Arduino.h>
#include <WiFiManager.h>
#include <ESP8266WebServer.h>
#include <PubSubClient.h> // MQTT server library
#include <EasyButton.h>
#include <ArduinoJson.h>
#include <Ticker.h> // for LED status indications
#include "settings.h" // Application settings
#include "FlowMeter.h" // Flow meter

// HW mapping
#define PinMeter1 D5
#define PinMeter2 D6
#define PinRelay1 D2
#define PinRelay2 D3
#define PinButton1 D7
#define PinButton2 D4
#define PinLed1 D0
#define PinLed2 D1
#define PinLedStatus D8

// Pin arrays
const uint8_t BUTTON_PINS[RELAYS_COUNT] = { PinButton1, PinButton2 };
const uint8_t LED_PINS[RELAYS_COUNT] = { PinLed1, PinLed2 };
const uint8_t RELAY_PINS[RELAYS_COUNT] = { PinRelay1, PinRelay2 };
const uint8_t METER_PINS[RELAYS_COUNT] = { PinMeter1, PinMeter2 };

// schedules LED blinking
Ticker ticker;

const char *ConfigFileName = "/config.json";
Configuration Config; 

unsigned long relayTimeoutWhen[RELAYS_COUNT];
//unsigned long relay1timeoutWhen;
//unsigned long relay2timeoutWhen;

ESP8266WebServer server(80);

// MQTT
WiFiClient espClient;
PubSubClient mqttClient(espClient);
unsigned long lastMqttConnectionRetryTime;
unsigned long mqttReconnectDelay = 30000;
String mqttLwtTopic;
String mqttTopicRelayStatus[RELAYS_COUNT];
String mqttTopicRelayCommand[RELAYS_COUNT];
bool relayState[RELAYS_COUNT];

EasyButton buttons[RELAYS_COUNT] = { 
  EasyButton(PinButton1), 
  EasyButton(PinButton2) 
};

FlowMeter meters[RELAYS_COUNT] = {
  FlowMeter(PinMeter1),
  FlowMeter(PinMeter2)
};

// The hall-effect flow sensor outputs approximately 4.5 pulses per second per
// litre/minute of flow.
float calibrationFactor = 4.5;

void readConfigurationFile() {
  // set defaults
  for(int i = 0; i < RELAYS_COUNT; i++) {
    Config.relays[i].name = String("Relay " + i);
    Config.relays[i].timeout = 0;
  }

  // read config file
  if(SPIFFS.exists(ConfigFileName))
  {
    Serial.println("Reading existing configuration.");

    File configFile = SPIFFS.open(ConfigFileName, "r");

    StaticJsonDocument<512> json;
    DeserializationError error = deserializeJson(json, configFile);
    if (error)
      Serial.println(F("Failed to read file, using default configuration"));

    // Copy values from the JsonDocument to the Config
    // https://arduinojson.org/v6/example/config/
    Config.mqtt_port = json["mqtt_port"] | 1883;
    Config.mqtt_server = json["mqtt_server"].as<String>();
    Config.mqtt_user = json["mqtt_user"].as<String>();
    Config.mqtt_password = json["mqtt_password"].as<String>();
    Config.mqtt_channel = json["mqtt_channel"].as<String>();
    
    if(json.containsKey("relays")) {
      JsonArray relays = json["relays"].as<JsonArray>();
      if(!relays.isNull()) {
        int i = 0;
        for(JsonObject relay : relays) {
          Config.relays[i].name = relay["name"].as<String>();
          Config.relays[i].timeout = json["timeout"] | 0;
          i++;
        }
      }
    }

//    Config.relay_1_name = json["relay_1_name"].as<String>();
//    if(Config.relay_1_name.length() == 0) {
//      Config.relay_1_name = "Relay 1";
//    }
//    Config.relay_2_name = json["relay_2_name"].as<String>();
//    if(Config.relay_2_name.length() == 0) {
//      Config.relay_2_name = "Relay 2";
//    }
//    Config.relay_1_timeout = json["relay_1_timeout"] | 0;
//    Config.relay_2_timeout = json["relay_2_timeout"] | 0;

    configFile.close();
  }
}

void saveConfigurationFile() {
  Serial.println("Saving configuration file.");

  File configFile = SPIFFS.open(ConfigFileName, "w");

  // Allocate a temporary JsonDocument
  // Don't forget to change the capacity to match your requirements.
  // Use arduinojson.org/assistant to compute the capacity.
  StaticJsonDocument<640> jsonDocument;

  // Set global values 
  jsonDocument["mqtt_server"] = Config.mqtt_server;
  jsonDocument["mqtt_port"] = Config.mqtt_port;
  jsonDocument["mqtt_user"] = Config.mqtt_user;
  jsonDocument["mqtt_password"] = Config.mqtt_password;
  jsonDocument["mqtt_channel"] = Config.mqtt_channel;

  // and per relay
  JsonArray relays = jsonDocument.createNestedArray("relays");
  for(int i = 0; i < RELAYS_COUNT; i++) {
    JsonObject relay = relays.createNestedObject();
    relay["name"] = Config.relays[i].name;
    relay["timeout"] = Config.relays[i].timeout;
  }

  // Serialize JSON to file
  if (serializeJson(jsonDocument, configFile) == 0) {
    Serial.println(F("Failed to write settings file."));
  }

  // Close the file
  configFile.close();
}

void tickStatusLed() {
  //toggle state
  int state = digitalRead(PinLedStatus);  // get the current state of GPIO1 pin
  digitalWrite(PinLedStatus, !state);     // set pin to the opposite state

  Serial.println("Status LED tick.");
}

void toggleRelay(int id) {
  uint8_t relayPin = RELAY_PINS[id];
  uint8_t ledPin = LED_PINS[id];
  String channel = mqttTopicRelayStatus[id];

  int currentValue = digitalRead(relayPin);
  int newValue = !currentValue;

  Serial.printf("Toggling relay #%i from %i to %i", id, currentValue, newValue);

  // Do the toggle
  // HIGH (0x1) = OFF, LOW (0x0) = ON
  digitalWrite(relayPin, newValue); // relay
  digitalWrite(ledPin, !newValue); // led
  
  relayState[id] = !newValue;

  if(relayState[id] && Config.relays[id].timeout > 0) { // if enabling and is timeout set, activate
    relayTimeoutWhen[id] = millis() + (Config.relays[id].timeout * 60 * 1000);
  } else {
    relayTimeoutWhen[id] = 0;
  }
/*
  if(id == 1) {
    if(relayState[0] && Config.relay_1_timeout > 0) { // if enabling and is timeout set, activate
      relay1timeoutWhen = millis() + (Config.relay_1_timeout * 60 * 1000); // timeout in settings is in minutes
    } else {
      relay1timeoutWhen = 0;
    }

  } else if (id == 2) {
    if(relayState[1] && Config.relay_2_timeout > 0) { // if enabling and is timeout set, activate
      relay2timeoutWhen = millis() + (Config.relay_2_timeout * 60 * 1000); // timeout in settings is in minutes
    } else {
      relay2timeoutWhen = 0;
    }
  }
*/
  Serial.println();

  // And publish state update via MQTT
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Publishing updated state after toggle.");

    String value = String(relayState[id]);
    mqttClient.publish(channel.c_str(), value.c_str());
  }
}

void mqttSubscriptionCallback(char* topic, byte* payload, unsigned int length) {
  // report to terminal for debug
  Serial.print("[MQTT] Received message in topic '");
  Serial.print(topic);
  Serial.print("' with content: ");
  for (uint i = 0; i < length; i++) {
    Serial.print((char)payload[i]);
  }
  Serial.println();

  // check if we received topics for state change 
  if (strcmp (mqttTopicRelayCommand[0].c_str(), topic) == 0) {
    Serial.printf("Relay 1 state change requested to %c", payload[0]);
    if(
        (payload[0] == '1' && relayState[0] == false) ||
        (payload[0] == '0' && relayState[0] == true)
      ) {
        Serial.print(", current state ");
        Serial.print(relayState[0]);
        Serial.println(" differs -> toggle");
        toggleRelay(0);
    } else {
      Serial.println();
    }
  } else if (strcmp (mqttTopicRelayCommand[1].c_str(), topic) == 0) {
    Serial.print("Relay 2 state change requested");
    if(
        (payload[0] == '1' && relayState[1] == false) ||
        (payload[0] == '0' && relayState[1] == true)
      ) {
           Serial.print(", current state ");
        Serial.print(relayState[1]);
        Serial.println(" differs -> toggle");
          toggleRelay(1);
    } else {
      Serial.println();
    }
  }  else {
    Serial.println("[MQTT] No match for any action.");
  }
}

void setupMqtt(int retries) { 
  if(mqttClient.connected()) {
    Serial.println("[MQTT] Disconnecting...");
    mqttClient.disconnect();
  }

  if(Config.mqtt_server.length() == 0) {
    return; // no server, no connection needed
  }
  
