machv/esp8266-irrigator/src/main.cpp
  mqttLwtTopic = String(Config.mqtt_channel + "status");
  for(int i = 0; i < RELAYS_COUNT; i++) {
    // in MQTT relays are numbered starting with 1, not 0
    mqttTopicRelayStatus[i] = String(Config.mqtt_channel + "state/" + (i + 1));
    mqttTopicRelayCommand[i] = String(Config.mqtt_channel + "command/" + (i + 1));
  }

  mqttClient.setServer(Config.mqtt_server.c_str(), Config.mqtt_port);
  mqttClient.setCallback(mqttSubscriptionCallback);

  const char *mqtt_user = nullptr;
  const char *mqtt_password = nullptr;
  if (Config.mqtt_user.length() > 0) 
    mqtt_user = Config.mqtt_user.c_str();
  if (Config.mqtt_user.length() > 0) 
    mqtt_password = Config.mqtt_password.c_str();

  // Build Client ID from MAC Address
  uint32_t chipId = ESP.getChipId();
  char clientId[20];
  snprintf(clientId, 20, "Zavlazovac-%08X", chipId);

  int retryCount = 0;
  while (!mqttClient.connected() && retryCount < retries) {
      Serial.printf("[MQTT] Connecting (retry %d of %d)...", (retryCount + 1), retries);
      Serial.println();
  
      bool connectionState = false;
      connectionState = mqttClient.connect(clientId, mqtt_user, mqtt_password, mqttLwtTopic.c_str(), 1, true, "Offline");
      
      if (connectionState) {
        Serial.println("[MQTT] Connected successfully.");  

        // publish online status to LWT
        mqttClient.publish(mqttLwtTopic.c_str(), "Online");
      } else {
        Serial.print("[MQTT] Connection failed with code: ");
        Serial.println(mqttClient.state());

        if(retryCount > 0) { // delay only if more retries are requested
          delay(1000);
        }
      }

      retryCount++;
  }

  // And subscribe to respective channels
  if(mqttClient.connected()) {
    for(int i = 0; i < RELAYS_COUNT; i++) {
      Serial.printf("[MQTT] Publishing current state of relay %d.\n", i);
      String value = String(relayState[i]);
      mqttClient.publish(mqttTopicRelayStatus[i].c_str(), value.c_str());

      Serial.printf("[MQTT] Subscribing to the command channel: %s\n", mqttTopicRelayCommand[i].c_str());
      mqttClient.subscribe(mqttTopicRelayCommand[i].c_str());
    }
  }

  lastMqttConnectionRetryTime = millis();
}

void connectMqtt() {
  setupMqtt(5); // By default try 5-times before gave up
}

// Gets called when WiFiManager enters configuration mode
void configModeCallback (WiFiManager *myWiFiManager) {
  Serial.println("Entered config mode");
  Serial.println(WiFi.softAPIP());
  //if you used auto generated SSID, print it
  Serial.println(myWiFiManager->getConfigPortalSSID());
  
  //entered config mode, make led toggle faster
  ticker.attach(0.2, tickStatusLed);
}

String SendStylesheetContent() {
  String ptr;

  ptr += "html { font-family: Helvetica; display: inline-block; margin: 0px auto; text-align: center;}\n";
  ptr += "body{margin-top: 50px;} h1 {color: #444444;margin: 50px auto 30px;} h3 {color: #444444;margin-bottom: 5px;}\n";
  ptr += ".button {display: block;background-color: #1abc9c;border: none;color: white;padding: 13px 30px;text-decoration: none;font-size: 25px;margin: 0px auto 15px;cursor: pointer;border-radius: 4px;}\n";
  ptr += ".button-on {background-color: #1abc9c;}\n";
  ptr += ".button-on:active {background-color: #16a085;}\n";
  ptr += ".button-off {background-color: #34495e;}\n";
  ptr += ".button-off:active {background-color: #2c3e50;}\n";
  ptr += ".settings-cell {text-align: center; font-size: 14pt; padding: 4px; padding-top: 20px}\n";
  ptr += "th, td {text-align: left; font-size: 12pt}";
  ptr += "input { padding: 5px; font-size: 12pt}";
  ptr += "table {margin: 0 auto; margin-bottom: 20px}\n";
  ptr += ".small { font-size: 75%}\n";
  ptr += "p {font-size: 14px;color: #888;margin-bottom: 10px;}\n";

  return ptr;
}

void handle_stylesheetFile() {
  server.send(200, "text/css", SendStylesheetContent()); 
}

String SendJavascriptContent() {
  String str = "";

  str += "function startTimer(duration, display) {\n"
    "var timer = duration, minutes, seconds;\n"
    "setInterval(function () {\n"
    "    minutes = parseInt(timer / 60, 10)\n"
    "    seconds = parseInt(timer % 60, 10);\n"
    "\n"
    "    minutes = minutes < 10 ? \"0\" + minutes : minutes;\n"
    "    seconds = seconds < 10 ? \"0\" + seconds : seconds;\n"
    "\n"
    "    display.textContent = minutes + \":\" + seconds;\n"
    "\n"
    "    if (--timer < 0) {\n"
    "        display.textContent = \"\";\n"         
    "    //    timer = duration;\n"
    "    }\n"
    "}, 1000);\n"
    "}\n";

  return str;
}

void handle_jsFile() {
  server.send(200, "text/javascript", SendJavascriptContent());
}

String SendSettingsHTML(){
  Serial.println("Sending Config HTML.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač / Settings</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "</head>\n";
  ptr += "<body><div class=\"page\">\n";
  ptr += "<h1>Zavlažovač</h1>\n";
  ptr += "<h2>Settings</h2>\n";
  
  if(server.hasArg("saved")) {
    ptr += "<div style=\"text-align: center; margin: 20px; font-weight: bold\">Configuration was saved.</div>";
  }

  ptr +="<form method=\"post\" enctype=\"application/x-www-form-urlencoded\">\n";
  ptr +="<table>\n"  
    "<tr>"
    " <th colspan=\"2\" class=\"settings-cell\">Relay 1</th>"
    "</tr>"
    
    "  <tr>\n"
    "    <th>Name</th>\n"
    "    <td><input type=\"text\" name=\"relay_1_name\" value=\"" + (Config.relays[0].name) + "\"></td>\n"
    "  </tr>\n"
    
    "  <tr>\n"
    "    <th>Timeout</th>\n"
    "    <td><input type=\"text\" name=\"relay_1_timeout\" value=\"" + (Config.relays[0].timeout) + "\"> min.<div class=\"small\">In minutes, 0 means no timeout.</div></td>\n"
    "  </tr>\n"

    "<tr>"
    " <th colspan=\"2\" class=\"settings-cell\">Relay 2</th>"
    "</tr>"

    "  <tr>\n"
    "    <th>Name</th>\n"
    "    <td><input type=\"text\" name=\"relay_2_name\" value=\"" + (Config.relays[1].name) + "\"></td>\n"
    "  </tr>\n"

    "  <tr>\n"
    "    <th>Timeout</th>\n"
    "    <td><input type=\"text\" name=\"relay_2_timeout\" value=\"" + (Config.relays[1].timeout) + "\"> min.<div class=\"small\">In minutes, 0 means no timeout.</div></td>\n"
    "  </tr>\n"

  "<tr>"
  "<th colspan=\"2\" class=\"settings-cell\">MQTT Settings</th>"
  "</tr>"
  "  <tr>\n"
  "    <th>Server</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_server\" value=\"" + (Config.mqtt_server) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>Port</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_port\" value=\"" + (Config.mqtt_port) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>User</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_user\" value=\"" + (Config.mqtt_user) + "\"></td>\n"
  "  </tr>\n"

    "  <tr>\n"
  "    <th>Password</th>\n"
  "    <td><input type=\"password\" name=\"mqtt_password\" value=\"" + (Config.mqtt_password) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th>Channel prefix</th>\n"
  "    <td><input type=\"text\" name=\"mqtt_channel\" value=\"" + (Config.mqtt_channel) + "\"></td>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th class=\"settings-cell\" colspan=\"2\"><input class=\"button\" type=\"submit\" value=\"Save Changes\"></th>\n"
  "  </tr>\n"

  "  <tr>\n"
  "    <th class=\"settings-cell\" colspan=\"2\"><a href=\"/\" class=\"button\">Back</a></th>\n"
  "  </tr>\n"
  "</table>\n";
  
  ptr +="</form>\n"
        "</body>\n"
        "</html>\n";
  
  return ptr;
}

// t is time in seconds = millis()/1000;
char * millisToString(unsigned long millis)
{
  unsigned long seconds = millis / 1000;
  static char str[12];
  long h = seconds / 3600;
  seconds = seconds % 3600;
  int m = seconds / 60;
  int s = seconds % 60;
 sprintf(str, "%02ld:%02d:%02d", h, m, s);
 
 return str;
}

String SendHTML(){
  Serial.println("Sending homepage HTML.");

  String ptr = "<!DOCTYPE html> <html>\n";
  ptr += "<head><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=no\">\n";
  ptr += "<title>Zavlažovač</title>\n";
  ptr += "<link href=\"/style.css\" type=\"text/css\" rel=\"stylesheet\"/>\n";
  ptr += "<script type=\"text/javascript\" src=\"scripts.js\"></script>\n";
  
  if(Config.relays[0].timeout > 0 && relayTimeoutWhen[0] > 0) {
    unsigned long remainingSecondsTimer1 = (relayTimeoutWhen[0] - millis()) / 1000;
    ptr += "<script type=\"text/javascript\">\n"
          "window.onload = function () {\n"
          "  var timerSeconds = ";
    ptr += remainingSecondsTimer1;
    ptr += ";\n"
          "  var display = document.querySelector('#relay_1_timer');\n"
          "   startTimer(timerSeconds, display);\n"
          "};\n"
          "</script>";
  }

  if(Config.relays[1].timeout > 0 && relayTimeoutWhen[1] > 0) {
    unsigned long remainingSecondsTimer2 = (relayTimeoutWhen[1] - millis()) / 1000;
    ptr += "<script type=\"text/javascript\">\n"
          "window.onload = function () {\n"
          "  var timerSeconds = ";
    ptr += remainingSecondsTimer2;
    ptr += ";\n"
          "  var display = document.querySelector('#relay_2_timer');\n"
          "   startTimer(timerSeconds, display);\n"
          "};\n"
          "</script>";
  }

