machv/esp8266-irrigator/src/main.cpp
  ptr += "</head>\n";
  ptr += "<body>\n<div class=\"page\">";
  ptr += "<h1>Zavlažovač</h1>\n";
  
  unsigned int frac;

  ptr += "<div>";
  ptr += "<h2>" + Config.relays[0].name + "</h2>";

  if(Config.relays[0].timeout > 0 && relayTimeoutWhen[0] > 0) {
    ptr += "<h3 id=\"relay_1_timer\"></h3>";
  }

  ptr += "<table>";
  ptr += "<tr>"
         "<td colspan=\"2\" class=\"settings-cell\">";

  if(relayState[0] == true) {
    ptr += "<a class=\"button button-on\" href=\"/toggle?id=1\">Turn OFF</a>";
  } else {
    ptr += "<a class=\"button button-off\" href=\"/toggle?id=1\">Turn ON</a>";
  }
  ptr += "</td></tr>";

  if(Config.relays[0].timeout > 0 && relayTimeoutWhen[0] > 0) {
    ptr += "<tr>"
        "<th>Timer off after:</th>"
        "<td>";
    ptr += millisToString(relayTimeoutWhen[0] - millis());
    ptr += "</td></tr>";
  }

    ptr += "<tr>"
        "<th>Flow rate:</th>"
        "<td>";
  ptr += int(meters[0].flowRate); // Print the integer part of the variable
  ptr += "."; // Print the decimal point
  // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
  frac = (meters[0].flowRate - int(meters[0].flowRate)) * 10;
  ptr += frac; // Print the fractional part of the variable
  ptr += " L/min</td>"
        "</tr>"
        "<tr>"
        "<th>Current Liquid Flowing:</th>"
        "<td>";
  ptr += meters[0].flowMilliLitres;
  ptr += " mL/Sec</td>"
        "</tr>"
        "<tr>"
        "<th>Output Liquid Quantity:</th>"
        "<td>";
  ptr += meters[0].totalMilliLitres;
  ptr += " mL</td>"
         "</tr>";
  ptr += "</table>";
  ptr += "</div>";

  ptr += "<div>";
  ptr += "<h2>" + Config.relays[1].name + "</h2>";

  if(Config.relays[1].timeout > 0 && relayTimeoutWhen[1] > 0) {
    ptr += "<h3 id=\"relay_2_timer\"></h3>";
  }

  ptr += "<table>";
  ptr += "<tr>"
         "<td colspan=\"2\" class=\"settings-cell\">";
  
  if(relayState[1] == true) {
    ptr += "<a class=\"button button-on\" href=\"/toggle?id=2\">Turn OFF</a>";
  } else {
    ptr += "<a class=\"button button-off\" href=\"/toggle?id=2\">Turn ON</a>";
  }
  ptr += "</td></tr>";

  if(Config.relays[1].timeout > 0 && relayTimeoutWhen[1] > 0) {
    ptr += "<tr>"
        "<th>Turn off after:</th>"
        "<td>";
    ptr += millisToString(relayTimeoutWhen[1] - millis());
    ptr += "</td></tr>";
  }

  ptr += "<tr>"
         "<th>Flow rate:</th>"
         "<td>";
  ptr += int(meters[1].flowRate); // Print the integer part of the variable
  ptr += "."; // Print the decimal point
  // Determine the fractional part. The 10 multiplier gives us 1 decimal place.
  frac = (meters[1].flowRate - int(meters[1].flowRate)) * 10;
  ptr += frac; // Print the fractional part of the variable
  ptr += " L/min</td>"
        "</tr>"
        "<tr>"
        "<th>Current Liquid Flowing:</th>"
        "<td>";
  ptr += meters[1].flowMilliLitres / 1000;
  ptr += " L/Sec</td>"
        "</tr>"
        "<tr>"
        "<th>Output Liquid Quantity:</th>"
        "<td>";
  ptr += meters[1].totalMilliLitres / 1000;
  ptr += " L</td>"
         "</tr>";
  ptr += "</table>";

  ptr += "</div>";

  ptr +="<hr>\n";
  ptr +="<a class=\"button\" href=\"/config\">Configuration</a>\n";
  ptr +="</div></body>\n";
  ptr +="</html>\n";
  return ptr;
}

void handle_pageConfig() {
  server.send(200, "text/html", SendSettingsHTML()); 
}

void handle_saveConfig() {
  // Save runtime data
  String arg;
  arg = server.arg("mqtt_port");
  arg.trim();
  
  Config.mqtt_port = (arg.length() == 0 ? 1883 : arg.toInt());
  Config.mqtt_server = server.arg("mqtt_server");
  Config.mqtt_user = server.arg("mqtt_user"); 
  Config.mqtt_password = server.arg("mqtt_password");
  Config.relays[0].name = server.arg("relay_1_name");
  Config.relays[1].name = server.arg("relay_2_name");
  
  arg = server.arg("relay_1_timeout");
  arg.trim();
  Config.relays[0].timeout = (arg.length() == 0 ? 0 : arg.toInt());
  
  arg = server.arg("relay_2_timeout");
  arg.trim();
  Config.relays[1].timeout = (arg.length() == 0 ? 0 : arg.toInt());
  
  String channel = server.arg("mqtt_channel");
  channel.trim();
  if(!channel.endsWith("/"))
    channel += "/";
  Config.mqtt_channel = channel;

  saveConfigurationFile();

  // Reconnect MQTT to reflect changes
  connectMqtt();

  server.sendHeader("Location", "/config?saved=1", true);
  server.send(303, "text/plain"); 
}

void handle_OnConnect() {
  server.send(200, "text/html", SendHTML()); 
}

void handle_toggle() {
  if(!server.hasArg("id")) {
    server.send(400, "text/html", "Missing required id parameter.");
    return;
  }

  if(server.arg("id") == "1")
    toggleRelay(1);

  if(server.arg("id") == "2")
    toggleRelay(2);

  server.sendHeader("Location", "/");
  server.send(303, "text/plain");
}

void handle_NotFound() {
  server.send(404, "text/plain", "Not found");
}

// Callback function to be called when the button is pressed.
void onPressed1() {
	Serial.println("Button 1 has been pressed.");
  toggleRelay(1);
}

void onPressed2() {
	Serial.println("Button 2 has been pressed.");
  toggleRelay(2);
}

void meter0_triggered() {
  meters[0].pulseCounter++;

  Serial.printf("[FLOW] Flow meter 1 triggered, current counter = %d", meters[0].pulseCounter);
  Serial.println();
}
void meter1_triggered() {
  meters[1].pulseCounter++;

  Serial.printf("[FLOW] Flow meter 2 triggered, current counter = %d", meters[1].pulseCounter);
  Serial.println();
}

void meter_flowChanged(uint8_t pin) {
  int meterIndex = 0;
  bool meterFound = false;
  for(meterIndex = 0; meterIndex < RELAYS_COUNT; meterIndex++) {
    if(METER_PINS[meterIndex] == pin) {
      meterFound = true;
      break;
    }
  }

  if(!meterFound) {
    Serial.printf("[FLOW] Unable to find meter index for PIN %d", pin);
    Serial.println();

    return;
  }

  if(mqttClient.connected()) {
    String channelCurrent = String(Config.mqtt_channel + meterIndex + "/currentFlow");
    String valueCurrent = String(meters[meterIndex].flowRate);
    mqttClient.publish(channelCurrent.c_str(), valueCurrent.c_str());

    String channelTotal = String(Config.mqtt_channel + meterIndex + "/totalFlow");
    String valueTotal = String(meters[meterIndex].totalMilliLitres);
    mqttClient.publish(channelTotal.c_str(), valueTotal.c_str());
  }
}

void setup() {
  // For testing
  //SPIFFS.format();
  //WiFiManager.reset();

  // Set serial console Baud rate
  Serial.begin(115200);

