machv/esp8266-irrigator/src/main.cpp
  // Initialize the buttons
	buttons[0].begin();
  buttons[0].onPressed(onPressed1);
  
  buttons[1].begin();
  buttons[1].onPressed(onPressed2);
	
  // Initialize GPIO PINs
  pinMode(PinLed1, OUTPUT);
  pinMode(PinLed2, OUTPUT);
  pinMode(PinRelay1, OUTPUT);
  digitalWrite(PinRelay1, HIGH); // by default turn it off (=HIGH)
  pinMode(PinRelay2, OUTPUT);
  digitalWrite(PinRelay2, HIGH); // by default turn it off (=HIGH)

  // Prepare meters...
  meters[0].begin(meter0_triggered);
  meters[1].begin(meter1_triggered);
  for(int i = 0; i < RELAYS_COUNT; i++) {
    meters[i].onFlowChanged(meter_flowChanged);
  }

  // !!! using internal LED (LED_BUILTIN) blocks internal TTY output !!! On-board LED je připojena mezi TX1 = GPIO2 a VCC 

  // Set led pin as output
  pinMode(PinLedStatus, OUTPUT);
  // Start ticker with 0.5 because we start in AP mode and try to connect
  ticker.attach(0.6, tickStatusLed);

  // WiFiManager
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(120);
  
  if(!wifiManager.autoConnect("Zavlazovac-Setup")) {
      Serial.println("failed to connect and hit timeout");
      delay(3000);

      // Reset and try again, or maybe put it to deep sleep
      ESP.reset();
      delay(5000);
  } 

  // Set callback that gets called when connecting to previous WiFi fails, and enters Access Point mode
  wifiManager.setAPCallback(configModeCallback);

  // If we get here we have connected to the WiFi
  ticker.detach();
  // Keep status LED on
  digitalWrite(PinLedStatus, HIGH);

  // init values from file system
  if (SPIFFS.begin()) {
    Serial.println("File system is mounted.");

    readConfigurationFile();
  }

  // setup MQTT
  connectMqtt();

  // Web server pages
  server.on("/", handle_OnConnect);
  server.on("/config", HTTP_GET, handle_pageConfig);
  server.on("/config", HTTP_POST, handle_saveConfig);
  server.on("/toggle", handle_toggle);
  server.on("/style.css", handle_stylesheetFile);
  server.on("/scripts.js", handle_jsFile);
  server.onNotFound(handle_NotFound);  
  server.begin();
  Serial.println("HTTP server started");
}

void loop() {
  // Process web server requests
  server.handleClient();
  
  // MQTT reconnect if no connection with non-blocking delay
  if(!mqttClient.connected() && ((millis() - lastMqttConnectionRetryTime) > mqttReconnectDelay)) {
    setupMqtt(1);
  }
  
  // Process MQTT communication
  mqttClient.loop();
  
  for(int i = 0; i < RELAYS_COUNT; i++) {
    // Continuously read the status of the button. 
    buttons[i].read();

    // process flow meters
    meters[i].loop();

    // Process relay timeouts
    if(Config.relays[i].timeout > 0 && relayTimeoutWhen[i] > 0 && relayTimeoutWhen[i] < millis()) {
    Serial.println("Configured timeout for relay 1 exceeded -> toggling");
    toggleRelay(i);
    }
  }
}
